import { z } from 'zod';

export const loginSchema = z.object({
	userName: z
		.string()
		.min(6, 'نام کاربری حداقل 6 کاراکتر باشد')
		.max(255, 'نام کاربری نمی تواند بیشتر از 255 کاراکتر باشد'),
	password: z.string().min(6, 'حداقل 6 کاراکتر باشد').max(255, 'حداکثر 255 کاراکتر باشد')
});

export const registerSchema = z.object({
	name: z
		.string()
		.min(3, 'نام اجباری می باشد و باید حداقل 3 کاراکتر باشد')
		.max(50, 'نام نمیتواند بیشتر از 50 کاراکتر باشد'),
	lastName: z
		.string()
		.min(3, 'نام خانوادگی اجباری می باشد و باید حداقل 3 کاراکتر باشد')
		.max(50, 'نام خانوادگی نمیتواند بیشتر از 50 کاراکتر باشد'),
	userName: z
		.string()
		.min(6, 'نام کاربری حداقل 6 کاراکتر باشد')
		.max(255, 'نام کاربری نمی تواند بیشتر از 255 کاراکتر باشد'),
	password: z.string().min(6, 'حداقل 6 کاراکتر باشد').max(255, 'حداکثر 255 کاراکتر باشد')
});
